<a href="https://colab.research.google.com/github/mehdee4/hello-world/blob/master/Data_science_with_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pandas
import numpy as numpy
data3 = pandas.read_csv('countries.csv')
data3.head(3)

       country  year  population
0  Afghanistan  1952     8425333
1  Afghanistan  1957     9240934
2  Afghanistan  1962    10267083

In [ ]:
#data normalization

In [ ]:
#1. simple feature scaling . Resulting between zero and one
#X(new) =    X(old)   /    X(max)
simple_norm= \
data3['population'] / data3['population'].max()

simple_norm.tail(3)

1701    0.008649
1702    0.009044
1703    0.009336
Name: population, dtype: float64

In [ ]:
#2. Min - Max .  Resulting between zero and one
# X(new) = X(old) - X (min)   /   X(max) - X(min)
min_max_norm = \
(data3['population'] - data3['population'].min()) / (data3['population'].max() - data3['population'].min())

min_max_norm.tail(3)

1701    0.008604
1702    0.008999
1703    0.009291
Name: population, dtype: float64

In [ ]:
#3. Z score or standard score . values between  
# X(new) = X(old) - mean  /    standard deviasion
z_score = (data3['population'] - data3['population'].mean()) / data3['population'].std()

z_score.tail(3)

1701   -0.171535
1702   -0.166624
1703   -0.163003
Name: population, dtype: float64

In [ ]:
#Binning or classyfing
#to group values in year into three different groups

In [ ]:
bins= numpy.linspace (data3['year'].min(), data3['year'].max(), 4)\
. astype(int)

In [ ]:
binn_group_names = ['low', 'medium', 'high']

In [ ]:
data3['year_binning'] = pandas.cut(data3['year'], bins, labels = binn_group_names, include_lowest = True)

data3.head(5)

       country  year  population  test year_binning
0  Afghanistan  1952     8425333     1          low
1  Afghanistan  1957     9240934     1          low
2  Afghanistan  1962    10267083     1          low
3  Afghanistan  1967    11537966     1          low
4  Afghanistan  1972    13079460     1       medium

In [ ]:
#Categorical Variables
#learn more latter from the following
#https://pbpython.com/categorical-encoding.html

In [ ]:
#one Hot Encoding
#value 1, the rest zero

In [ ]:
pandas.get_dummies (data3['country'])

,Afghanistan,Albania,Algeria,Angola,Argentina,Australia,Austria,Bahrain,Bangladesh,Belgium,...,Uganda,United Kingdom,United States,Uruguay,Venezuela,Vietnam,West Bank and Gaza,"Yemen, Rep.",Zambia,Zimbabwe
0,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1699,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1700,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1701,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1702,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1703,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [ ]:
#Descriptive statistics

In [ ]:
data3.describe()

             year    population    test
count  1704.00000  1.704000e+03  1704.0
mean   1979.50000  2.960121e+07     1.0
std      17.26533  1.061579e+08     0.0
min    1952.00000  6.001100e+04     1.0
25%    1965.75000  2.793664e+06     1.0
50%    1979.50000  7.023596e+06     1.0
75%    1993.25000  1.958522e+07     1.0
max    2007.00000  1.318683e+09     1.0

In [ ]:
#group by count of items

In [ ]:
country_count = data3['country'].value_counts() \
.to_frame() #to conver series to data frame

In [ ]:
country_count.head(3)

           country
Tunisia         12
Morocco         12
Singapore       12

In [ ]:
#to rename columns
country_count.rename(columns = {'country':'value_counts'}, inplace =True)
country_count.head(3)

           value_counts
Tunisia              12
Morocco              12
Singapore            12

In [ ]:
#to assign name for index
country_count.index.name = ('country_name')
country_count.head(3)

              value_counts
country_name
Tunisia                 12
Morocco                 12
Singapore               12